src/test/resources/mockdata/invoices/52fd6ec7-ddc3-4c53-bc26-2779afc27136.json

{
  "id": "52fd6ec7-ddc3-4c53-bc26-2779afc27136",
  "chkSubscriptionOverlap": false,
  "currency": "USD",
  "folioInvoiceNo": "123invoicenumber45",
  "invoiceDate": "2018-07-20T00:00:00.000+0000",
  "note": "Some note 1",
  "paymentTerms": "Payment in Advance",
  "paymentMethod": "EFT",
  "status": "Open",
  "source": "024b6f41-c5c6-4280-858e-33fba452a334",
  "total": 5.0,
  "vendorInvoiceNo": "YK75851",
  "voucherNumber": "478",
  "paymentId": "a5065f0d-fb88-4d23-b0c1-57e754fba40e",
  "poNumbers": [
    "AB268758XYZ"
  ],
  "vendorId": "168f8a63-d612-406e-813f-c7527f241ac3",
  "manualPayment": true
}
